HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGeth_reg.h
/** \brief 40, Skew Control Register */
#define GETH_SKEWCTL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_SKEWCTL*)0xF001F040u)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Geth_Registers_Cfg_Geth1
 * \{  */
/** \brief 0, MAC Configuration Register */
#define GETH1_MAC_CONFIGURATION /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_CONFIGURATION*)0xF0019000u)

/** \brief 4, MAC Extended Configuration Register */
#define GETH1_MAC_EXT_CONFIGURATION /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_EXT_CONFIGURATION*)0xF0019004u)

/** \brief 8, MAC Packet Filter Register */
#define GETH1_MAC_PACKET_FILTER /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_PACKET_FILTER*)0xF0019008u)

/** \brief C, MAC Watchdog Timeout Register */
#define GETH1_MAC_WATCHDOG_TIMEOUT /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_WATCHDOG_TIMEOUT*)0xF001900Cu)

/** \brief 50, MAC VLAN Tag Control Register */
#define GETH1_MAC_VLAN_TAG_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_VLAN_TAG_CTRL*)0xF0019050u)

/** \brief 54, MAC VLAN Tag Data Register */
#define GETH1_MAC_VLAN_TAG_DATA /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_VLAN_TAG_DATA*)0xF0019054u)

/** \brief 54, MAC VLAN Tag Filter ${i} Register */
#define GETH1_MAC_VLAN_TAG_FILTER /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_VLAN_TAG_FILTER*)0xF0019054u)
/** Alias (User Manual Name) for GETH1_MAC_VLAN_TAG_FILTER.
* To use register names with standard convension, please use GETH1_MAC_VLAN_TAG_FILTER.
*/
#define GETH1_MAC_VLAN_TAG_FILTER_I (GETH1_MAC_VLAN_TAG_FILTER)
#define GETH1_MAC_VLAN_TAG_FILTER_0 (GETH1_MAC_VLAN_TAG_FILTER)
#define GETH1_MAC_VLAN_TAG_FILTER_1 (GETH1_MAC_VLAN_TAG_FILTER)
#define GETH1_MAC_VLAN_TAG_FILTER_2 (GETH1_MAC_VLAN_TAG_FILTER)
#define GETH1_MAC_VLAN_TAG_FILTER_3 (GETH1_MAC_VLAN_TAG_FILTER)
#define GETH1_MAC_VLAN_TAG_FILTER_4 (GETH1_MAC_VLAN_TAG_FILTER)
#define GETH1_MAC_VLAN_TAG_FILTER_5 (GETH1_MAC_VLAN_TAG_FILTER)
#define GETH1_MAC_VLAN_TAG_FILTER_6 (GETH1_MAC_VLAN_TAG_FILTER)
#define GETH1_MAC_VLAN_TAG_FILTER_7 (GETH1_MAC_VLAN_TAG_FILTER)

/** \brief 58, MAC VLAN Hash Table Register */
#define GETH1_MAC_VLAN_HASH_TABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_VLAN_HASH_TABLE*)0xF0019058u)

/** \brief 60, MAC VLAN Tag Inclusion or Replacement Register */
#define GETH1_MAC_VLAN_INCL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_VLAN_INCL*)0xF0019060u)

/** \brief 60, MAC VLAN Tag Inclusion or Replacement Register per Queue */
#define GETH1_MAC_VLAN_INCL_Q /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_VLAN_INCL_Q*)0xF0019060u)
/** Alias (User Manual Name) for GETH1_MAC_VLAN_INCL_Q.
* To use register names with standard convension, please use GETH1_MAC_VLAN_INCL_Q.
*/
#define GETH1_MAC_VLAN_INCL_Q_I (GETH1_MAC_VLAN_INCL_Q)
#define GETH1_MAC_VLAN_INCL_Q_0 (GETH1_MAC_VLAN_INCL_Q)
#define GETH1_MAC_VLAN_INCL_Q_1 (GETH1_MAC_VLAN_INCL_Q)
#define GETH1_MAC_VLAN_INCL_Q_2 (GETH1_MAC_VLAN_INCL_Q)
#define GETH1_MAC_VLAN_INCL_Q_3 (GETH1_MAC_VLAN_INCL_Q)

/** \brief 64, MAC Inner VLAN Tag Inclusion or Replacement Register */
#define GETH1_MAC_INNER_VLAN_INCL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_INNER_VLAN_INCL*)0xF0019064u)
/** Alias (User Manual Name) for GETH1_MAC_INNER_VLAN_INCL.
* To use register names with standard convension, please use GETH1_MAC_INNER_VLAN_INCL.
*/
#define GETH1_MAC_INNER_VLAN_INCL_I (GETH1_MAC_INNER_VLAN_INCL)
#define GETH1_MAC_INNER_VLAN_INCL_0 (GETH1_MAC_INNER_VLAN_INCL)
#define GETH1_MAC_INNER_VLAN_INCL_1 (GETH1_MAC_INNER_VLAN_INCL)
#define GETH1_MAC_INNER_VLAN_INCL_2 (GETH1_MAC_INNER_VLAN_INCL)
#define GETH1_MAC_INNER_VLAN_INCL_3 (GETH1_MAC_INNER_VLAN_INCL)

/** \brief 70, MAC Queue 0 TX Flow Control Register */
#define GETH1_MAC_Q0_TX_FLOW_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_Q0_TX_FLOW_CTRL*)0xF0019070u)

/** \brief 90, MAC Receive Flow Control Register */
#define GETH1_MAC_RX_FLOW_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_RX_FLOW_CTRL*)0xF0019090u)

/** \brief 94, MAC Receive Queue Control 4 register  */
#define GETH1_MAC_RXQ_CTRL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_RXQ_CTRL4*)0xF0019094u)

/** \brief A0, MAC Receive Queue Control 0 Register */
#define GETH1_MAC_RXQ_CTRL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_RXQ_CTRL0*)0xF00190A0u)

/** \brief A4, MAC Receive Queue Control 1 Register */
#define GETH1_MAC_RXQ_CTRL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_RXQ_CTRL1*)0xF00190A4u)

/** \brief A8, MAC Receive Queue Control 2 Register */
#define GETH1_MAC_RXQ_CTRL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_RXQ_CTRL2*)0xF00190A8u)

/** \brief B0, MAC Interrupt Status Register */
#define GETH1_MAC_INTERRUPT_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_INTERRUPT_STATUS*)0xF00190B0u)

/** \brief B4, MAC Interrupt Enable Register */
#define GETH1_MAC_INTERRUPT_ENABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_INTERRUPT_ENABLE*)0xF00190B4u)

/** \brief B8, MAC Receive Transmit Status Register */
#define GETH1_MAC_RX_TX_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_RX_TX_STATUS*)0xF00190B8u)

/** \brief C0, MAC PMT Control and Status Register */
#define GETH1_MAC_PMT_CONTROL_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_PMT_CONTROL_STATUS*)0xF00190C0u)

/** \brief C4, MAC Wake-up Packet Filter Register */
#define GETH1_MAC_RWK_PACKET_FILTER /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_RWK_PACKET_FILTER*)0xF00190C4u)

/** \brief C4, MAC Wake-up Filter Command 0 Register */
#define GETH1_RWK_FILTER_COMMAND_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RWK_FILTER_COMMAND_0*)0xF00190C4u)

/** \brief C4, MAC Wake-up Filter Offset 0 Register */
#define GETH1_RWK_FILTER_OFFSET_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RWK_FILTER_OFFSET_0*)0xF00190C4u)

/** \brief C4, MAC Wake-up Filter CRC ${i} Register */
#define GETH1_RWK_FILTER_CRC /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RWK_FILTER_CRC*)0xF00190C4u)
/** Alias (User Manual Name) for GETH1_RWK_FILTER_CRC.
* To use register names with standard convension, please use GETH1_RWK_FILTER_CRC.
*/
#define GETH1_RWK_FILTER_CRC_I (GETH1_RWK_FILTER_CRC)
#define GETH1_RWK_FILTER_CRC_0 (GETH1_RWK_FILTER_CRC)
#define GETH1_RWK_FILTER_CRC_1 (GETH1_RWK_FILTER_CRC)

/** \brief C4, MAC Wake-up ${i} Filter Byte Mask register */
#define GETH1_RWK_FILTER_BYTE_MASK /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RWK_FILTER_BYTE_MASK*)0xF00190C4u)
/** Alias (User Manual Name) for GETH1_RWK_FILTER_BYTE_MASK.
* To use register names with standard convension, please use GETH1_RWK_FILTER_BYTE_MASK.
*/
#define GETH1_RWK_FILTER_BYTE_MASK_I (GETH1_RWK_FILTER_BYTE_MASK)
#define GETH1_RWK_FILTER_BYTE_MASK_0 (GETH1_RWK_FILTER_BYTE_MASK)
#define GETH1_RWK_FILTER_BYTE_MASK_1 (GETH1_RWK_FILTER_BYTE_MASK)
#define GETH1_RWK_FILTER_BYTE_MASK_2 (GETH1_RWK_FILTER_BYTE_MASK)
#define GETH1_RWK_FILTER_BYTE_MASK_3 (GETH1_RWK_FILTER_BYTE_MASK)

