HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGeth_reg.h
/** \brief 378, MAC Address 15 High Register */
#define GETH1_MAC_ADDRESS_HIGH15 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019378u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH15.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH15.
*/
#define GETH1_MAC_ADDRESS15_HIGH (GETH1_MAC_ADDRESS_HIGH15)

/** \brief 37C, MAC Address 15 Low Register */
#define GETH1_MAC_ADDRESS_LOW15 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF001937Cu)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW15.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW15.
*/
#define GETH1_MAC_ADDRESS15_LOW (GETH1_MAC_ADDRESS_LOW15)

/** \brief 380, MAC Address 16 High Register */
#define GETH1_MAC_ADDRESS_HIGH16 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019380u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH16.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH16.
*/
#define GETH1_MAC_ADDRESS16_HIGH (GETH1_MAC_ADDRESS_HIGH16)

/** \brief 384, MAC Address 16 Low Register */
#define GETH1_MAC_ADDRESS_LOW16 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF0019384u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW16.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW16.
*/
#define GETH1_MAC_ADDRESS16_LOW (GETH1_MAC_ADDRESS_LOW16)

/** \brief 388, MAC Address 17 High Register */
#define GETH1_MAC_ADDRESS_HIGH17 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019388u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH17.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH17.
*/
#define GETH1_MAC_ADDRESS17_HIGH (GETH1_MAC_ADDRESS_HIGH17)

/** \brief 38C, MAC Address 17 Low Register */
#define GETH1_MAC_ADDRESS_LOW17 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF001938Cu)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW17.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW17.
*/
#define GETH1_MAC_ADDRESS17_LOW (GETH1_MAC_ADDRESS_LOW17)

/** \brief 390, MAC Address 18 High Register */
#define GETH1_MAC_ADDRESS_HIGH18 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019390u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH18.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH18.
*/
#define GETH1_MAC_ADDRESS18_HIGH (GETH1_MAC_ADDRESS_HIGH18)

/** \brief 394, MAC Address 18 Low Register */
#define GETH1_MAC_ADDRESS_LOW18 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF0019394u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW18.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW18.
*/
#define GETH1_MAC_ADDRESS18_LOW (GETH1_MAC_ADDRESS_LOW18)

/** \brief 398, MAC Address 19 High Register */
#define GETH1_MAC_ADDRESS_HIGH19 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019398u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH19.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH19.
*/
#define GETH1_MAC_ADDRESS19_HIGH (GETH1_MAC_ADDRESS_HIGH19)

/** \brief 39C, MAC Address 19 Low Register */
#define GETH1_MAC_ADDRESS_LOW19 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF001939Cu)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW19.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW19.
*/
#define GETH1_MAC_ADDRESS19_LOW (GETH1_MAC_ADDRESS_LOW19)

/** \brief 3A0, MAC Address 20 High Register */
#define GETH1_MAC_ADDRESS_HIGH20 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF00193A0u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH20.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH20.
*/
#define GETH1_MAC_ADDRESS20_HIGH (GETH1_MAC_ADDRESS_HIGH20)

/** \brief 3A4, MAC Address 20 Low Register */
#define GETH1_MAC_ADDRESS_LOW20 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF00193A4u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW20.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW20.
*/
#define GETH1_MAC_ADDRESS20_LOW (GETH1_MAC_ADDRESS_LOW20)

/** \brief 3A8, MAC Address 21 High Register */
#define GETH1_MAC_ADDRESS_HIGH21 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF00193A8u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH21.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH21.
*/
#define GETH1_MAC_ADDRESS21_HIGH (GETH1_MAC_ADDRESS_HIGH21)

/** \brief 3AC, MAC Address 21 Low Register */
#define GETH1_MAC_ADDRESS_LOW21 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF00193ACu)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW21.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW21.
*/
#define GETH1_MAC_ADDRESS21_LOW (GETH1_MAC_ADDRESS_LOW21)

/** \brief 3B0, MAC Address 22 High Register */
#define GETH1_MAC_ADDRESS_HIGH22 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF00193B0u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH22.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH22.
*/
#define GETH1_MAC_ADDRESS22_HIGH (GETH1_MAC_ADDRESS_HIGH22)

/** \brief 3B4, MAC Address 22 Low Register */
#define GETH1_MAC_ADDRESS_LOW22 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF00193B4u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW22.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW22.
*/
#define GETH1_MAC_ADDRESS22_LOW (GETH1_MAC_ADDRESS_LOW22)

/** \brief 3B8, MAC Address 23 High Register */
#define GETH1_MAC_ADDRESS_HIGH23 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF00193B8u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH23.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH23.
*/
#define GETH1_MAC_ADDRESS23_HIGH (GETH1_MAC_ADDRESS_HIGH23)

