HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGeth_reg.h
/** \brief B80, MAC PPS 0 Target Time Seconds Register */
#define GETH1_MAC_PPS0_TARGET_TIME_SECONDS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_PPS0_TARGET_TIME_SECONDS*)0xF0019B80u)

/** \brief B84, MAC PPS 0 Target Time Nanoeconds Register */
#define GETH1_MAC_PPS0_TARGET_TIME_NANOSECONDS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_PPS0_TARGET_TIME_NANOSECONDS*)0xF0019B84u)

/** \brief B88, MAC PPS 0 Interval Register */
#define GETH1_MAC_PPS0_INTERVAL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_PPS0_INTERVAL*)0xF0019B88u)

/** \brief B8C, MAC PPS 0 Width Register */
#define GETH1_MAC_PPS0_WIDTH /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_PPS0_WIDTH*)0xF0019B8Cu)

/** \brief C00, MTL Operation Mode Register */
#define GETH1_MTL_OPERATION_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_OPERATION_MODE*)0xF0019C00u)

/** \brief C20, MTL Interrupt Status Register */
#define GETH1_MTL_INTERRUPT_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_INTERRUPT_STATUS*)0xF0019C20u)

/** \brief C30, MTL Receive Queue and DMA Channel Mapping 0 Register */
#define GETH1_MTL_RXQ_DMA_MAP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_RXQ_DMA_MAP0*)0xF0019C30u)

/** \brief D00, MTL Queue 0 Transmit Operation Mode Register */
#define GETH1_MTL_TXQ0_OPERATION_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ0_OPERATION_MODE*)0xF0019D00u)

/** \brief D04, MTL Queue 0 Transmit Underflow Counter Register */
#define GETH1_MTL_TXQ0_UNDERFLOW /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ0_UNDERFLOW*)0xF0019D04u)

/** \brief D08, MTL Queue 0 Transmit Debug Register */
#define GETH1_MTL_TXQ0_DEBUG /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ0_DEBUG*)0xF0019D08u)

/** \brief D14, MTL Queue 0 Transmit Status Register */
#define GETH1_MTL_TXQ0_ETS_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ0_ETS_STATUS*)0xF0019D14u)

/** \brief D18, MTL Queue 0 Transmit Quantum or Weights Register */
#define GETH1_MTL_TXQ0_QUANTUM_WEIGHT /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ0_QUANTUM_WEIGHT*)0xF0019D18u)

/** \brief D2C, MTL Queue 0 Interrupt Control Status Register */
#define GETH1_MTL_Q0_INTERRUPT_CONTROL_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_Q0_INTERRUPT_CONTROL_STATUS*)0xF0019D2Cu)

/** \brief D30, MTL Queue 0 Receive Operation Mode Register */
#define GETH1_MTL_RXQ0_OPERATION_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_RXQ0_OPERATION_MODE*)0xF0019D30u)

/** \brief D34, MTL Queue 0 Receive Missed Packet and Overflow Counter Register */
#define GETH1_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT*)0xF0019D34u)

/** \brief D38, MTL Queue 0 Receive Debug Register */
#define GETH1_MTL_RXQ0_DEBUG /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_RXQ0_DEBUG*)0xF0019D38u)

/** \brief D3C, MTL Queue 0 Receive Control Register */
#define GETH1_MTL_RXQ0_CONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_RXQ0_CONTROL*)0xF0019D3Cu)

/** \brief D40, MTL Queue 1 Transmit Operation Mode Register */
#define GETH1_MTL_TXQ1_OPERATION_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ_OPERATION_MODE*)0xF0019D40u)

/** \brief D44, MTL Queue 1 Transmit Underflow Counter Register */
#define GETH1_MTL_TXQ1_UNDERFLOW /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ_UNDERFLOW*)0xF0019D44u)

/** \brief D48, MTL Queue 1 Transmit Debug Register */
#define GETH1_MTL_TXQ1_DEBUG /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ_DEBUG*)0xF0019D48u)

/** \brief D50, MTL Queue 1 Transmit ETS Control Register */
#define GETH1_MTL_TXQ1_ETS_CONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ_ETS_CONTROL*)0xF0019D50u)

/** \brief D54, MTL Queue 1 Transmit ETS Status Register */
#define GETH1_MTL_TXQ1_ETS_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ_ETS_STATUS*)0xF0019D54u)

/** \brief D58, MTL Queue 1 Transmit Quantum or Weights Register */
#define GETH1_MTL_TXQ1_QUANTUM_WEIGHT /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ_QUANTUM_WEIGHT*)0xF0019D58u)

/** \brief D5C, MTL Queue 1 Transmit SendSlopeCredit Register */
#define GETH1_MTL_TXQ1_SENDSLOPECREDIT /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ_SENDSLOPECREDIT*)0xF0019D5Cu)

/** \brief D60, MTL Queue 1 Transmit HiCredit Register */
#define GETH1_MTL_TXQ1_HICREDIT /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ_HICREDIT*)0xF0019D60u)

/** \brief D64, MTL Queue 1 Transmit LoCredit Register */
#define GETH1_MTL_TXQ1_LOCREDIT /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ_LOCREDIT*)0xF0019D64u)

/** \brief D6C, MTL Queue 1 Interrupt Status Register */
#define GETH1_MTL_Q1_INTERRUPT_CONTROL_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS*)0xF0019D6Cu)

/** \brief D70, MTL Queue 1 Receive Operation Mode Register */
#define GETH1_MTL_RXQ1_OPERATION_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_RXQ_OPERATION_MODE*)0xF0019D70u)

/** \brief D74, MTL Queue 1 Receive Missed Packet and Overflow Counter Register */
#define GETH1_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT*)0xF0019D74u)

/** \brief D78, MTL Queue 1 Receive Debug Register */
#define GETH1_MTL_RXQ1_DEBUG /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_RXQ_DEBUG*)0xF0019D78u)

/** \brief D7C, MTL Queue 1 Receive Control Register */
#define GETH1_MTL_RXQ1_CONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_RXQ_CONTROL*)0xF0019D7Cu)

/** \brief D80, MTL Queue 2 Transmit Operation Mode Register */
#define GETH1_MTL_TXQ2_OPERATION_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ_OPERATION_MODE*)0xF0019D80u)

/** \brief D84, MTL Queue 2 Transmit Underflow Counter Register */
#define GETH1_MTL_TXQ2_UNDERFLOW /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ_UNDERFLOW*)0xF0019D84u)

/** \brief D88, MTL Queue 2 Transmit Debug Register */
#define GETH1_MTL_TXQ2_DEBUG /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ_DEBUG*)0xF0019D88u)

/** \brief D90, MTL Queue 2 Transmit ETS Control Register */
#define GETH1_MTL_TXQ2_ETS_CONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ_ETS_CONTROL*)0xF0019D90u)

/** \brief D94, MTL Queue 2 Transmit ETS Status Register */
#define GETH1_MTL_TXQ2_ETS_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ_ETS_STATUS*)0xF0019D94u)

/** \brief D98, MTL Queue 2 Transmit Quantum or Weights Register */
#define GETH1_MTL_TXQ2_QUANTUM_WEIGHT /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ_QUANTUM_WEIGHT*)0xF0019D98u)

/** \brief D9C, MTL Queue 2 Transmit SendSlopeCredit Register */
#define GETH1_MTL_TXQ2_SENDSLOPECREDIT /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MTL_TXQ_SENDSLOPECREDIT*)0xF0019D9Cu)

