HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGeth_reg.h
/** \brief 1244, DMA Channel 2 Current Application Transmit Descriptor Register */
#define GETH1_DMA_CH2_CURRENT_APP_TXDESC /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_CURRENT_APP_TXDESC*)0xF001A244u)

/** \brief 124C, DMA Channel 2 Current Application Receive Descriptor Register */
#define GETH1_DMA_CH2_CURRENT_APP_RXDESC /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_CURRENT_APP_RXDESC*)0xF001A24Cu)

/** \brief 1254, DMA Channel 2 Current Application Transmit Buffer Address Register */
#define GETH1_DMA_CH2_CURRENT_APP_TXBUFFER /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_CURRENT_APP_TXBUFFER*)0xF001A254u)

/** \brief 125C, DMA Channel 2 Current Application Receive Buffer Address Register */
#define GETH1_DMA_CH2_CURRENT_APP_RXBUFFER /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_CURRENT_APP_RXBUFFER*)0xF001A25Cu)

/** \brief 1260, DMA Channel 2 Status Register */
#define GETH1_DMA_CH2_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_STATUS*)0xF001A260u)

/** \brief 1264, DMA Channel 2 Missed Frames Count Register */
#define GETH1_DMA_CH2_MISS_FRAME_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_MISS_FRAME_CNT*)0xF001A264u)

/** \brief 1280, DMA Channel 3 Control Register */
#define GETH1_DMA_CH3_CONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_CONTROL*)0xF001A280u)

/** \brief 1284, DMA Channel 3 Transmit Control Register */
#define GETH1_DMA_CH3_TX_CONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_TX_CONTROL*)0xF001A284u)

/** \brief 1288, DMA Channel 3 Receive Control Register */
#define GETH1_DMA_CH3_RX_CONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_RX_CONTROL*)0xF001A288u)

/** \brief 1294, DMA Channel 3 Transmit Descriptor List Address Register */
#define GETH1_DMA_CH3_TXDESC_LIST_ADDRESS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_TXDESC_LIST_ADDRESS*)0xF001A294u)

/** \brief 129C, DMA Channel 3 Receive Descriptor List Address Register */
#define GETH1_DMA_CH3_RXDESC_LIST_ADDRESS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_RXDESC_LIST_ADDRESS*)0xF001A29Cu)

/** \brief 12A0, DMA Channel 3 Transmit Descriptor Tail Pointer Register */
#define GETH1_DMA_CH3_TXDESC_TAIL_POINTER /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_TXDESC_TAIL_POINTER*)0xF001A2A0u)

/** \brief 12A8, DMA Channel 3 Recieve Descriptor Tail Pointer Register */
#define GETH1_DMA_CH3_RXDESC_TAIL_POINTER /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_RXDESC_TAIL_POINTER*)0xF001A2A8u)

/** \brief 12AC, DMA Channel 3 Transmit Descriptor Ring Length Register */
#define GETH1_DMA_CH3_TXDESC_RING_LENGTH /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_TXDESC_RING_LENGTH*)0xF001A2ACu)

/** \brief 12B0, DMA Channel 3 Recieve Descriptor Ring Length Register */
#define GETH1_DMA_CH3_RXDESC_RING_LENGTH /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_RXDESC_RING_LENGTH*)0xF001A2B0u)

/** \brief 12B4, DMA Channel 3 Interrupt Enable Register */
#define GETH1_DMA_CH3_INTERRUPT_ENABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_INTERRUPT_ENABLE*)0xF001A2B4u)

/** \brief 12B8, DMA Channel 3 Recieve Interrupt Watchdog Timer Register */
#define GETH1_DMA_CH3_RX_INTERRUPT_WATCHDOG_TIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER*)0xF001A2B8u)

/** \brief 12BC, DMA Channel 3 Slot Function Control and Status Register */
#define GETH1_DMA_CH3_SLOT_FUNCTION_CONTROL_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS*)0xF001A2BCu)

/** \brief 12C4, DMA Channel 3 Current Application Transmit Descriptor Register */
#define GETH1_DMA_CH3_CURRENT_APP_TXDESC /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_CURRENT_APP_TXDESC*)0xF001A2C4u)

/** \brief 12CC, DMA Channel 3 Current Application Receive Descriptor Register */
#define GETH1_DMA_CH3_CURRENT_APP_RXDESC /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_CURRENT_APP_RXDESC*)0xF001A2CCu)

/** \brief 12D4, DMA Channel 3 Current Application Transmit Buffer Address Register */
#define GETH1_DMA_CH3_CURRENT_APP_TXBUFFER /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_CURRENT_APP_TXBUFFER*)0xF001A2D4u)

/** \brief 12DC, DMA Channel 3 Current Application Receive Buffer Address Register */
#define GETH1_DMA_CH3_CURRENT_APP_RXBUFFER /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_CURRENT_APP_RXBUFFER*)0xF001A2DCu)

/** \brief 12E0, DMA Channel 3 Status Register */
#define GETH1_DMA_CH3_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_STATUS*)0xF001A2E0u)

/** \brief 12E4, DMA Channel 3 Missed Frames Count Register */
#define GETH1_DMA_CH3_MISS_FRAME_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_DMA_CH_MISS_FRAME_CNT*)0xF001A2E4u)

/** \brief 0, Clock Control Register */
#define GETH1_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_CLC*)0xF001B000u)

/** \brief 4, Module Identification Register */
#define GETH1_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_ID*)0xF001B004u)

/** \brief 8, General Purpose Control Register */
#define GETH1_GPCTL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_GPCTL*)0xF001B008u)

/** \brief C, Access Enable Register 0 */
#define GETH1_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_ACCEN0*)0xF001B00Cu)

/** \brief 10, Access Enable Register 1 */
#define GETH1_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_ACCEN1*)0xF001B010u)

/** \brief 14, Kernel Reset Register 0 */
#define GETH1_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_KRST0*)0xF001B014u)

/** \brief 18, Kernel Reset Register 1 */
#define GETH1_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_KRST1*)0xF001B018u)

/** \brief 1C, Kernel Reset Status Clear Register */
#define GETH1_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_KRSTCLR*)0xF001B01Cu)

/** \brief 20, Access Enable Register 0 for DMA0 */
#define GETH1_ACCEND0_ACCEN0D /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_ACCEND_ACCEN0D*)0xF001B020u)
/** Alias (User Manual Name) for GETH1_ACCEND0_ACCEN0D.
* To use register names with standard convension, please use GETH1_ACCEND0_ACCEN0D.
*/
#define GETH1_ACCEN0D0 (GETH1_ACCEND0_ACCEN0D)

/** \brief 24, Access Enable Register 1 for DMA0 */
#define GETH1_ACCEND0_ACCEN1D /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_ACCEND_ACCEN1D*)0xF001B024u)
/** Alias (User Manual Name) for GETH1_ACCEND0_ACCEN1D.
* To use register names with standard convension, please use GETH1_ACCEND0_ACCEN1D.
*/
#define GETH1_ACCEN1D0 (GETH1_ACCEND0_ACCEN1D)

/** \brief 28, Access Enable Register 0 for DMA1 */
#define GETH1_ACCEND1_ACCEN0D /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_ACCEND_ACCEN0D*)0xF001B028u)
/** Alias (User Manual Name) for GETH1_ACCEND1_ACCEN0D.
* To use register names with standard convension, please use GETH1_ACCEND1_ACCEN0D.
*/
#define GETH1_ACCEN0D1 (GETH1_ACCEND1_ACCEN0D)

/** \brief 2C, Access Enable Register 1 for DMA1 */
#define GETH1_ACCEND1_ACCEN1D /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_ACCEND_ACCEN1D*)0xF001B02Cu)
/** Alias (User Manual Name) for GETH1_ACCEND1_ACCEN1D.
* To use register names with standard convension, please use GETH1_ACCEND1_ACCEN1D.
*/
#define GETH1_ACCEN1D1 (GETH1_ACCEND1_ACCEN1D)

/** \brief 30, Access Enable Register 0 for DMA2 */
#define GETH1_ACCEND2_ACCEN0D /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_ACCEND_ACCEN0D*)0xF001B030u)
/** Alias (User Manual Name) for GETH1_ACCEND2_ACCEN0D.
* To use register names with standard convension, please use GETH1_ACCEND2_ACCEN0D.
*/
#define GETH1_ACCEN0D2 (GETH1_ACCEND2_ACCEN0D)

/** \brief 34, Access Enable Register 1 for DMA2 */
#define GETH1_ACCEND2_ACCEN1D /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_ACCEND_ACCEN1D*)0xF001B034u)
/** Alias (User Manual Name) for GETH1_ACCEND2_ACCEN1D.
* To use register names with standard convension, please use GETH1_ACCEND2_ACCEN1D.
*/
#define GETH1_ACCEN1D2 (GETH1_ACCEND2_ACCEN1D)

/** \brief 38, Access Enable Register 0 for DMA3 */
#define GETH1_ACCEND3_ACCEN0D /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_ACCEND_ACCEN0D*)0xF001B038u)
/** Alias (User Manual Name) for GETH1_ACCEND3_ACCEN0D.
* To use register names with standard convension, please use GETH1_ACCEND3_ACCEN0D.
*/
#define GETH1_ACCEN0D3 (GETH1_ACCEND3_ACCEN0D)

/** \brief 3C, Access Enable Register 1 for DMA3 */
#define GETH1_ACCEND3_ACCEN1D /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_ACCEND_ACCEN1D*)0xF001B03Cu)
/** Alias (User Manual Name) for GETH1_ACCEND3_ACCEN1D.
* To use register names with standard convension, please use GETH1_ACCEND3_ACCEN1D.
*/
#define GETH1_ACCEN1D3 (GETH1_ACCEND3_ACCEN1D)

/** \brief 40, Skew Control Register */
#define GETH1_SKEWCTL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_SKEWCTL*)0xF001B040u)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXGETH_REG_H */
